---
kind: method
id: M:Autodesk.Revit.DB.FolderItemInfo.Dispose
source: html/a1ae313b-adb7-9760-9d9f-bb232057f2b2.htm
---
# Autodesk.Revit.DB.FolderItemInfo.Dispose Method

Releases all resources used by the FolderItemInfo

## Syntax (C#)
```csharp
public void Dispose()
```